images/core_packages.mmd
flowchart TB
    subgraph galaxy["galaxy"]
        tool_util_models["tool_util_models"]
        util["util"]
        auth["auth"]
        files["files"]
        data["data"]
        navigation["navigation"]
        job_execution["job-execution"]
        job_metrics["job-metrics"]
        objectstore["objectstore"]
        selenium["selenium"]
        tool_util["tool-util"]
        tours["tours"]
        app["app"]
        web_apps["web-apps"]
        web_framework["web-framework"]
        web_stack["web-stack"]
    end
    subgraph galaxy_test["galaxy_test"]
        test_base["test-base"]
        test_driver["test-driver"]
        test_api["test-api"]
        test_selenium["test-selenium"]
    end

    tool_util --> util
    tool_util --> tool_util_models
    files --> util
    objectstore --> util
    data --> objectstore
    data --> files
    selenium --> util
    selenium --> navigation
    tours --> navigation
    web_stack --> util
    job_metrics --> util
    job_execution --> data
    app --> auth
    app --> job_execution
    app --> web_framework
    app --> tours
    web_framework --> data
    web_framework --> web_stack
    web_apps --> app
    auth --> data
    app --> tool_util
    app --> job_metrics

    test_driver --> test_base
    test_driver --> web_apps
    test_base --> tool_util
    test_api --> test_base
    test_selenium --> test_base
    test_api -. optional .-> test_driver
    test_selenium -. optional .-> test_driver
    test_selenium --> selenium
